app/controllers/placemarks_controller.rb

SELECT * FROM "placemarks"
---
  def index
=begin
    @placemarks = Placemark.all

SELECT * FROM "placemarks"
---
  def yml
     path_xml = RAILS_ROOT + "/public/simpleobject.xml"
     xml_text = File.open( path_xml , 'r'){ |file| file.read }
       Placemark.all.each  do  |placemark|

SELECT * FROM "placemarks"
---
  def yml_auth
     path_xml = RAILS_ROOT + "/public/simpleobject.xml"
     xml_text = File.open( path_xml , 'r'){ |file| file.read }
       Placemark.all.each  do  |placemark|

SELECT * FROM "placemarks" WHERE ("placemarks"."id" = 6)
---
  def show
    @placemark = Placemark.find(params[:id])

SELECT * FROM "placemarks" WHERE ("placemarks"."id" = 11)
---
  def edit
     if logged_in?
       @placemark = Placemark.find(params[:id])

SELECT * FROM "categories" WHERE ("categories"."id" = 1)
SELECT * FROM "placemarks" WHERE ("placemarks"."id" = 980190962)
INSERT INTO "placemarks" ("created_at", "category", "geopoint", "updated_at", "adress", "foto", "category_id", "description") VALUES('2011-02-17 19:38:23', NULL, 'qw', '2011-02-17 19:38:23', 'qqwqwqw', 'qwq', NULL, 'qwq')
---
  def create
    @placemark = Placemark.new(params[:placemark])

      begin
        @placemark.category = Category.find(@placemark.category_id)
      end

    respond_to do |format|
      if @placemark.save

SELECT * FROM "placemarks" WHERE ("placemarks"."id" = 19)
UPDATE "placemarks" SET "updated_at" = '2011-02-25 19:00:23', "adress" = '', "foto" = '', "description" = '', "category_id" = 1 WHERE "id" = 20
---
  def update
    @placemark = Placemark.find(params[:id])

    respond_to do |format|
      if @placemark.update_attributes(params[:placemark])

SELECT * FROM "placemarks" WHERE ("placemarks"."id" = 980190962)
DELETE FROM "placemarks" WHERE "id" = 980190962
---
  def destroy
    @placemark = Placemark.find(params[:id])
    @placemark.destroy